FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/БонусныеБаллы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеБаллы</Name>
			<Comment>Бонусные баллы</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количетсво</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКНачислению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Comment>Бонусная программа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БонуснаяКарта</Name>
					<Comment>Бонусная карта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСписанияБонусов</Name>
					<Comment>Дата списания бонусов</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/БонусныеПрограммыРегламентныеЗадания/Ext/Module.bsl
#Область СписаниеИАктивацияБонусныхБаллов

Процедура АктивацияБонусныхБаллов(Знач СтруктураПараметров) Экспорт
	
	Обработка = Обработки.АктивацияБонусныхБаллов.Создать();
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.Свойство("УчетнаяЗапись"      , Обработка.УчетнаяЗаписьЭлектроннойПочты);
		СтруктураПараметров.Свойство("ШаблонРассылкиSMS"  , Обработка.ШаблонРассылкиSMS);
		СтруктураПараметров.Свойство("ШаблонРассылкиEMail", Обработка.ШаблонРассылкиEMail)
	КонецЕсли;
	
	Результат = Обработка.СоздатьДокументыКорректировкиБонусов();
	Если Результат <> Неопределено И Обработка.ТаблицаРассылок.Количество() > 0 Тогда
		Обработка.ВыполнитьРассылкуУведомлений(Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура СписаниеПросроченныхБонусныхБаллов(Знач СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БонусныеБаллыОстатки.БонуснаяКарта       КАК Карточка,
	|	БонусныеБаллыОстатки.ДатаСписанияБонусов КАК ДатаСписания,
	|	БонусныеБаллыОстатки.КоличествоОстаток   КАК Количество
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы.Остатки(, ДатаСписанияБонусов < &ТекДата) КАК БонусныеБаллыОстатки";
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// создадим документ
		#Если Клиент Тогда
		Сообщить("-------------------------------------------------------------");
		Сообщить("Списание просроченных балллов.");
		#КонецЕсли
		
		НовыйДокумент = Документы.КорректировкаБонусов.СоздатьДокумент();
		НовыйДокумент.Заполнить(Неопределено);
		НовыйДокумент.УстановитьНовыйНомер();
		
		НовыйДокумент.Комментарий = "Создан регламентным заданием ""Списание просроченных бонусных баллов""";
		
		НовыйДокумент.БонусыКСписанию.Загрузить(РезультатЗапроса.Выгрузить());
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			#Если Клиент Тогда
			Сообщить(НСтр("ru = 'Сформирован документ '") + Строка(НовыйДокумент.Ссылка) + ".");
			#КонецЕсли
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Сообщить(ИнформацияОбОшибке.Описание +"|"+ ИнформацияОбОшибке.Причина);
		КонецПопытки;
		
		#Если Клиент Тогда
		Сообщить("-------------------------------------------------------------");
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

Процедура ОповещениеОБонусныхБаллах(Знач СтруктураПараметров) Экспорт
	
	Обработка = Обработки.РассылкаИнформацииОБонусныхБаллах.Создать();
	Обработка.Дата = ТекущаяДата();
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтруктураПараметров.Свойство("УчетнаяЗапись"      , Обработка.УчетнаяЗаписьЭлектроннойПочты);
		СтруктураПараметров.Свойство("ШаблонРассылкиSMS"  , Обработка.ШаблонРассылкиSMS);
		СтруктураПараметров.Свойство("ШаблонРассылкиEMail", Обработка.ШаблонРассылкиEMail)
	КонецЕсли;
	
	Обработка.АвтоматическаяРассылка();
	
КонецПроцедуры

#КонецОбласти
